Updating a doc
